perf/heavy3.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

#Se supone endpoint heavy con 0.5 de LOOP
#Deberia sobrecargar al sistema errores de conexion
# Con 8 request deberia ser suficiente
#Sino clavamos 16
  phases:
    - name: Plain0
      duration: 60
      arrivalRate: 2
    - name: Ramp0
      duration: 60
      arrivalRate: 2
      rampTo: 4
    - name: Plain1
      duration: 60
      arrivalRate: 4
    - name: Ramp1
      duration: 60
      arrivalRate: 4
      rampTo: 8
    - name: Plain2
      duration: 60
      arrivalRate: 8



scenarios:
  - name: Heavy (/heavy)
    flow:
      - get:
          url: '/heavy'