perf/root.yaml
config:
  environments:
    first:
      target: 'http://localhost:5555/first/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    second:
      target: 'http://localhost:5555/second/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  #Se asume 0.5 de LOOP
  #El endpoint deberia aguantarse esta demanda
  phases:
    - name: Plain0
      duration: 60
      arrivalRate: 2
    - name: Ramp
      duration: 60
      arrivalRate: 2
      rampTo: 4
    - name: Plain
      duration: 60
      arrivalRate: 4



scenarios:
  - name: Root
    flow:
      - get:
          url: '/'