perf/timeout.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 60
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5
    - name: Ramp 2
      duration: 60
      arrivalRate: 5
      rampTo: 10
    - name: Plain 2
      duration: 60
      arrivalRate: 10
    - name: Ramp 3
      duration: 60
      arrivalRate: 10
      rampTo: 15
    - name: Plain 3
      duration: 60
      arrivalRate: 15

scenarios:
  - name: Timeout (/timeout)
    flow:
      - get:
          url: '/timeout'